<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'ناو',
    'column.guard_name' => 'ناوی پاسەوان',
    'column.roles' => 'ڕۆڵەکان',
    'column.permissions' => 'دەسەڵاتەکان',
    'column.updated_at' => 'بەرواری نوێکردنەوە',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'ناو',
    'field.guard_name' => 'ناوی پاسەوان',
    'field.permissions' => 'دەسەڵاتەکان',
    'field.select_all.name' => 'هەموو دەسەڵاتەکان هەڵبژێرە',
    'field.select_all.message' => 'دەسەڵاتەکانی هەموو ڕۆڵەکان بۆ ئەم ڕۆڵەدا چالاک بکە',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'labels.nav.group.settings',
    'nav.role.label' => 'دەسەڵاتەکان',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'دەسەڵات',
    'resource.label.roles' => 'دەسەڵاتەکان',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'یەکەکان',
    'resources' => 'سەرچاوەکان',
    'widgets' => 'ئیکسسوارات',
    'pages' => 'لاپەڕەکان',
    'custom' => 'مۆڵەتی تایبەتمەند',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'تۆ مۆڵەتی چوونە ژوورەوەت نییە',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'بینین',
        'view_any' => 'بینینی هەموو',
        'create' => 'زیادکردن',
        'update' => 'نوێکردنەوە',
        'delete' => 'ئەرشیفکردن',
        'delete_any' => 'ئەرشیفکردنی هەموو',
        'force_delete' => 'سڕینەوە',
        'force_delete_any' => 'سڕینەوەی هەموو',
        'reorder' => 'ڕێکخستن',
        'restore' => 'گەڕاندنەوە',
        'restore_any' => 'گەڕاندنەوەی هەموو',
        'replicate' => 'دووبارەکردنەوە',
    ],
];
